#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ALX-Terraform-Labs/demo-giithub-actions/runs/run-isPmG8F6YrmELuj6

Waiting for the plan to start...

Terraform v1.1.6
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0fd2f33ef5320f8ff]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0595c98f4ac56a23f]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0a0645f62ae5e0db6]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0e5858c481195c1c5]
aws_security_group.web-sg: Refreshing state... [id=sg-059fad3e87888a623]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0308715b21002f1ac]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-083c1f780f2376031]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0ede75d50e328cff1]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c9b34c06ab74b068]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-03d55a5bd0fdf3ef1]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08e74662769bcc001]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-002e8656dc37a9a1c]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0e5858c481195c1c51080289494]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-097afe7a386a63346]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0e7d5455cebd6ce93]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-00ce9d5fc94a28b74]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07a1b7844f9726f1f]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-02682dc0c3e31d4bc]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-01884b98e75a083e3]
module.ec2.aws_instance.this[0]: Refreshing state... [id=i-0abd295f03b18c274]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0c9b34c06ab74b0681080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-03d55a5bd0fdf3ef11080289494]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_security_group.web-sg has changed
  ~ resource "aws_security_group" "web-sg" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-059fad3e87888a623"
        name                   = "allow_tcp_web"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group.web-sg must be replaced
-/+ resource "aws_security_group" "web-sg" {
      ~ arn                    = "arn:aws:ec2:us-west-2:315105850655:security-group/sg-059fad3e87888a623" -> (known after apply)
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ]
      ~ id                     = "sg-059fad3e87888a623" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "http"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      ~ name                   = "allow_tcp_web" -> "allow_http_web" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "315105850655" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.ec2.aws_instance.this[0] must be replaced
-/+ resource "aws_instance" "this" {
      ~ arn                                  = "arn:aws:ec2:us-west-2:315105850655:instance/i-0abd295f03b18c274" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-west-2a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-0abd295f03b18c274" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-009bc5a5b9aba2653" -> (known after apply)
      ~ private_dns                          = "ip-10-0-101-38.us-west-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.101.38" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "54.244.81.84" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Environment" = "dev"
            "Name"        = "my-ec2-web"
            "Terraform"   = "true"
        }
      ~ user_data                            = "dece31035f1c0b04df1feac69fbe484b38969f38" -> "0ae87834805167a1ed88f968d6b5f036d93877e8" # forces replacement
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-059fad3e87888a623",
        ] -> (known after apply)
        # (11 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }


      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-02c897d3dc00e325f" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # module.vpc.aws_eip.nat[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_eip" "nat" {
      - allocation_id        = "eipalloc-0595c98f4ac56a23f" -> null
      - association_id       = "eipassoc-06d904af63edbd76f" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-0595c98f4ac56a23f" -> null
      - network_border_group = "us-west-2" -> null
      - network_interface    = "eni-08978b2d79c1810ec" -> null
      - private_dns          = "ip-10-0-101-192.us-west-2.compute.internal" -> null
      - private_ip           = "10.0.101.192" -> null
      - public_dns           = "ec2-52-32-198-50.us-west-2.compute.amazonaws.com" -> null
      - public_ip            = "52.32.198.50" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-us-west-2a"
          - "Terraform"   = "true"
        } -> null
      - tags_all             = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-us-west-2a"
          - "Terraform"   = "true"
        } -> null
      - vpc                  = true -> null
    }

  # module.vpc.aws_eip.nat[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "aws_eip" "nat" {
      - allocation_id        = "eipalloc-0a0645f62ae5e0db6" -> null
      - association_id       = "eipassoc-07b630156144186af" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-0a0645f62ae5e0db6" -> null
      - network_border_group = "us-west-2" -> null
      - network_interface    = "eni-04fd8c7f9bcf9c2d9" -> null
      - private_dns          = "ip-10-0-102-46.us-west-2.compute.internal" -> null
      - private_ip           = "10.0.102.46" -> null
      - public_dns           = "ec2-52-88-17-133.us-west-2.compute.amazonaws.com" -> null
      - public_ip            = "52.88.17.133" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-us-west-2b"
          - "Terraform"   = "true"
        } -> null
      - tags_all             = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-us-west-2b"
          - "Terraform"   = "true"
        } -> null
      - vpc                  = true -> null
    }

  # module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-083c1f780f2376031"
      ~ tags     = {
          ~ "Name"        = "example-vpc" -> "terra-vpc"
            # (2 unchanged elements hidden)
        }
      ~ tags_all = {
          ~ "Name"        = "example-vpc" -> "terra-vpc"
            # (2 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_nat_gateway" "this" {
      - allocation_id        = "eipalloc-0595c98f4ac56a23f" -> null
      - connectivity_type    = "public" -> null
      - id                   = "nat-01884b98e75a083e3" -> null
      - network_interface_id = "eni-08978b2d79c1810ec" -> null
      - private_ip           = "10.0.101.192" -> null
      - public_ip            = "52.32.198.50" -> null
      - subnet_id            = "subnet-08e74662769bcc001" -> null
      - tags                 = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-us-west-2a"
          - "Terraform"   = "true"
        } -> null
      - tags_all             = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-us-west-2a"
          - "Terraform"   = "true"
        } -> null
    }

  # module.vpc.aws_nat_gateway.this[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "aws_nat_gateway" "this" {
      - allocation_id        = "eipalloc-0a0645f62ae5e0db6" -> null
      - connectivity_type    = "public" -> null
      - id                   = "nat-02682dc0c3e31d4bc" -> null
      - network_interface_id = "eni-04fd8c7f9bcf9c2d9" -> null
      - private_ip           = "10.0.102.46" -> null
      - public_ip            = "52.88.17.133" -> null
      - subnet_id            = "subnet-0ede75d50e328cff1" -> null
      - tags                 = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-us-west-2b"
          - "Terraform"   = "true"
        } -> null
      - tags_all             = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-us-west-2b"
          - "Terraform"   = "true"
        } -> null
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_route" "private_nat_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-0c9b34c06ab74b0681080289494" -> null
      - nat_gateway_id         = "nat-01884b98e75a083e3" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0c9b34c06ab74b068" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "aws_route" "private_nat_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-03d55a5bd0fdf3ef11080289494" -> null
      - nat_gateway_id         = "nat-02682dc0c3e31d4bc" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-03d55a5bd0fdf3ef1" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.aws_route_table.private[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-west-2:315105850655:route-table/rtb-0c9b34c06ab74b068" -> null
      - id               = "rtb-0c9b34c06ab74b068" -> null
      - owner_id         = "315105850655" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-01884b98e75a083e3"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-private-us-west-2a"
          - "Terraform"   = "true"
        } -> null
      - tags_all         = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-private-us-west-2a"
          - "Terraform"   = "true"
        } -> null
      - vpc_id           = "vpc-0fd2f33ef5320f8ff" -> null
    }

  # module.vpc.aws_route_table.private[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-west-2:315105850655:route-table/rtb-03d55a5bd0fdf3ef1" -> null
      - id               = "rtb-03d55a5bd0fdf3ef1" -> null
      - owner_id         = "315105850655" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-02682dc0c3e31d4bc"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-private-us-west-2b"
          - "Terraform"   = "true"
        } -> null
      - tags_all         = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-private-us-west-2b"
          - "Terraform"   = "true"
        } -> null
      - vpc_id           = "vpc-0fd2f33ef5320f8ff" -> null
    }

  # module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0e5858c481195c1c5"
      ~ tags             = {
          ~ "Name"        = "example-vpc-public" -> "terra-vpc-public"
            # (2 unchanged elements hidden)
        }
      ~ tags_all         = {
          ~ "Name"        = "example-vpc-public" -> "terra-vpc-public"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.private[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-0e7d5455cebd6ce93" -> null
      - route_table_id = "rtb-0c9b34c06ab74b068" -> null
      - subnet_id      = "subnet-0308715b21002f1ac" -> null
    }

  # module.vpc.aws_route_table_association.private[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-097afe7a386a63346" -> null
      - route_table_id = "rtb-03d55a5bd0fdf3ef1" -> null
      - subnet_id      = "subnet-002e8656dc37a9a1c" -> null
    }

  # module.vpc.aws_route_table_association.public[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-07a1b7844f9726f1f" -> null
      - route_table_id = "rtb-0e5858c481195c1c5" -> null
      - subnet_id      = "subnet-0ede75d50e328cff1" -> null
    }

  # module.vpc.aws_subnet.private[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-west-2:315105850655:subnet/subnet-0308715b21002f1ac" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-2a" -> null
      - availability_zone_id                           = "usw2-az1" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0308715b21002f1ac" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "315105850655" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-private-us-west-2a"
          - "Terraform"   = "true"
        } -> null
      - tags_all                                       = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-private-us-west-2a"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                                         = "vpc-0fd2f33ef5320f8ff" -> null
    }

  # module.vpc.aws_subnet.private[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-west-2:315105850655:subnet/subnet-002e8656dc37a9a1c" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-2b" -> null
      - availability_zone_id                           = "usw2-az2" -> null
      - cidr_block                                     = "10.0.2.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-002e8656dc37a9a1c" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "315105850655" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-private-us-west-2b"
          - "Terraform"   = "true"
        } -> null
      - tags_all                                       = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-private-us-west-2b"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                                         = "vpc-0fd2f33ef5320f8ff" -> null
    }

  # module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-08e74662769bcc001"
      ~ tags                                           = {
          ~ "Name"        = "example-vpc-public-us-west-2a" -> "terra-vpc-public-us-west-2a"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          ~ "Name"        = "example-vpc-public-us-west-2a" -> "terra-vpc-public-us-west-2a"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-west-2:315105850655:subnet/subnet-0ede75d50e328cff1" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-2b" -> null
      - availability_zone_id                           = "usw2-az2" -> null
      - cidr_block                                     = "10.0.102.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0ede75d50e328cff1" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "315105850655" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-public-us-west-2b"
          - "Terraform"   = "true"
        } -> null
      - tags_all                                       = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-public-us-west-2b"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                                         = "vpc-0fd2f33ef5320f8ff" -> null
    }

  # module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                               = "vpc-0fd2f33ef5320f8ff"
      ~ tags                             = {
          ~ "Name"        = "example-vpc" -> "terra-vpc"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                         = {
          ~ "Name"        = "example-vpc" -> "terra-vpc"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

Plan: 2 to add, 4 to change, 16 to destroy.

Changes to Outputs:
  ~ ec2-dns            = [
      - "",
      + (known after apply),
    ]
  ~ vpc_public_subnets = [
        "subnet-08e74662769bcc001",
      - "subnet-0ede75d50e328cff1",
    ]

```

</details>

*Pusher: @alexbatistasp, Action: `pull_request`*